antmicro/pigweed-mimxrt595-samples/examples/04_bluetooth_audio/config/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitFlexSPI0BPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitFlexSPI0BPins(void)
{

    const uint32_t FLEXSPI0_SCLK = (/* Pin is configured as FLEXSPI0_SCLK */
                                    IOPCTL_PIO_FUNC1 |
                                    /* Disable pull-up / pull-down function */
                                    IOPCTL_PIO_PUPD_DI |
                                    /* Enable pull-down function */
                                    IOPCTL_PIO_PULLDOWN_EN |
                                    /* Enables input buffer function */
                                    IOPCTL_PIO_INBUF_EN |
                                    /* Normal mode */
                                    IOPCTL_PIO_SLEW_RATE_NORMAL |
                                    /* Full drive enable */
                                    IOPCTL_PIO_FULLDRIVE_EN |
                                    /* Analog mux is disabled */
                                    IOPCTL_PIO_ANAMUX_DI |
                                    /* Pseudo Output Drain is disabled */
                                    IOPCTL_PIO_PSEDRAIN_DI |
                                    /* Input function is not inverted */
                                    IOPCTL_PIO_INV_DI);
    /* PORT1 PIN18 (coords: T17) is configured as FLEXSPI0_SCLK */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_SCLK_PORT, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_SCLK_PIN, FLEXSPI0_SCLK);

    const uint32_t FLEXSPI0_CS = (/* Pin is configured as FLEXSPI0_SS0_N */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Normal mode */
                                  IOPCTL_PIO_SLEW_RATE_NORMAL |
                                  /* Full drive enable */
                                  IOPCTL_PIO_FULLDRIVE_EN |
                                  /* Analog mux is disabled */
                                  IOPCTL_PIO_ANAMUX_DI |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI);
    /* PORT1 PIN19 (coords: U16) is configured as FLEXSPI0_SS0_N */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_CS_PORT, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_CS_PIN, FLEXSPI0_CS);

    const uint32_t FLEXSPI0_DATA0 = (/* Pin is configured as FLEXSPI0_DATA0 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Normal mode */
                                     IOPCTL_PIO_SLEW_RATE_NORMAL |
                                     /* Full drive enable */
                                     IOPCTL_PIO_FULLDRIVE_EN |
                                     /* Analog mux is disabled */
                                     IOPCTL_PIO_ANAMUX_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI);
    /* PORT1 PIN20 (coords: T15) is configured as FLEXSPI0_DATA0 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA0_PORT, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA0_PIN, FLEXSPI0_DATA0);

    const uint32_t FLEXSPI0_DATA1 = (/* Pin is configured as FLEXSPI0_DATA1 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Normal mode */
                                     IOPCTL_PIO_SLEW_RATE_NORMAL |
                                     /* Full drive enable */
                                     IOPCTL_PIO_FULLDRIVE_EN |
                                     /* Analog mux is disabled */
                                     IOPCTL_PIO_ANAMUX_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI);
    /* PORT1 PIN21 (coords: T14) is configured as FLEXSPI0_DATA1 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA1_PORT, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA1_PIN, FLEXSPI0_DATA1);

    const uint32_t FLEXSPI0_DATA2 = (/* Pin is configured as FLEXSPI0_DATA2 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Normal mode */
                                     IOPCTL_PIO_SLEW_RATE_NORMAL |
                                     /* Full drive enable */
                                     IOPCTL_PIO_FULLDRIVE_EN |
                                     /* Analog mux is disabled */
                                     IOPCTL_PIO_ANAMUX_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI);
    /* PORT1 PIN22 (coords: R13) is configured as FLEXSPI0_DATA2 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA2_PORT, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA2_PIN, FLEXSPI0_DATA2);

    const uint32_t FLEXSPI0_DATA3 = (/* Pin is configured as FLEXSPI0_DATA3 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Normal mode */
                                     IOPCTL_PIO_SLEW_RATE_NORMAL |
                                     /* Full drive enable */
                                     IOPCTL_PIO_FULLDRIVE_EN |
                                     /* Analog mux is disabled */
                                     IOPCTL_PIO_ANAMUX_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI);
    /* PORT1 PIN23 (coords: R12) is configured as FLEXSPI0_DATA3 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA3_PORT, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA3_PIN, FLEXSPI0_DATA3);

    const uint32_t FLEXSPI0_DATA4 = (/* Pin is configured as FLEXSPI0_DATA4 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Normal mode */
                                     IOPCTL_PIO_SLEW_RATE_NORMAL |
                                     /* Full drive enable */
                                     IOPCTL_PIO_FULLDRIVE_EN |
                                     /* Analog mux is disabled */
                                     IOPCTL_PIO_ANAMUX_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI);
    /* PORT1 PIN24 (coords: N12) is configured as FLEXSPI0_DATA4 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA4_PORT, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA4_PIN, FLEXSPI0_DATA4);

