antmicro/pigweed-mimxrt595-samples/examples/04_bluetooth_audio/config/pin_mux.c
    const uint32_t FLEXSPI0_DATA5 = (/* Pin is configured as FLEXSPI0_DATA5 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Normal mode */
                                     IOPCTL_PIO_SLEW_RATE_NORMAL |
                                     /* Full drive enable */
                                     IOPCTL_PIO_FULLDRIVE_EN |
                                     /* Analog mux is disabled */
                                     IOPCTL_PIO_ANAMUX_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI);
    /* PORT1 PIN25 (coords: R14) is configured as FLEXSPI0_DATA5 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA5_PORT, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA5_PIN, FLEXSPI0_DATA5);

    const uint32_t FLEXSPI0_DATA6 = (/* Pin is configured as FLEXSPI0_DATA6 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Normal mode */
                                     IOPCTL_PIO_SLEW_RATE_NORMAL |
                                     /* Full drive enable */
                                     IOPCTL_PIO_FULLDRIVE_EN |
                                     /* Analog mux is disabled */
                                     IOPCTL_PIO_ANAMUX_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI);
    /* PORT1 PIN26 (coords: P14) is configured as FLEXSPI0_DATA6 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA6_PORT, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA6_PIN, FLEXSPI0_DATA6);

    const uint32_t FLEXSPI0_DATA7 = (/* Pin is configured as FLEXSPI0_DATA7 */
                                     IOPCTL_PIO_FUNC1 |
                                     /* Disable pull-up / pull-down function */
                                     IOPCTL_PIO_PUPD_DI |
                                     /* Enable pull-down function */
                                     IOPCTL_PIO_PULLDOWN_EN |
                                     /* Enables input buffer function */
                                     IOPCTL_PIO_INBUF_EN |
                                     /* Normal mode */
                                     IOPCTL_PIO_SLEW_RATE_NORMAL |
                                     /* Full drive enable */
                                     IOPCTL_PIO_FULLDRIVE_EN |
                                     /* Analog mux is disabled */
                                     IOPCTL_PIO_ANAMUX_DI |
                                     /* Pseudo Output Drain is disabled */
                                     IOPCTL_PIO_PSEDRAIN_DI |
                                     /* Input function is not inverted */
                                     IOPCTL_PIO_INV_DI);
    /* PORT1 PIN27 (coords: P13) is configured as FLEXSPI0_DATA7 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA7_PORT, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA7_PIN, FLEXSPI0_DATA7);

    const uint32_t FLEXSPI0_DQS = (/* Pin is configured as FLEXSPI0_DQS */
                                   IOPCTL_PIO_FUNC1 |
                                   /* Enable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_EN |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Normal mode */
                                   IOPCTL_PIO_SLEW_RATE_NORMAL |
                                   /* Full drive enable */
                                   IOPCTL_PIO_FULLDRIVE_EN |
                                   /* Analog mux is disabled */
                                   IOPCTL_PIO_ANAMUX_DI |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI);
    /* PORT1 PIN28 (coords: U14) is configured as FLEXSPI0_DQS */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DQS_PORT, BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DQS_PIN, FLEXSPI0_DQS);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPinsM2:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: A6, peripheral: USDHC1, signal: 'USDHC_DATA, 2', pin_signal: PIO3_12/SD1_D2/LCD_D13/CTIMER_INP0/FC10_RTS_SCL_SSELN1, pupdena: enabled, pupdsel: pullUp,
    ibena: enabled}
  - {pin_num: B7, peripheral: USDHC1, signal: 'USDHC_DATA, 3', pin_signal: PIO3_13/SD1_D3/LCD_D14/CTIMER_INP1/FC10_SSELN2, pupdena: enabled, pupdsel: pullUp, ibena: enabled}
  - {pin_num: A8, peripheral: USDHC1, signal: USDHC_CLK, pin_signal: PIO3_8/SD1_CLK/LCD_D9/CTIMER0_MAT0/FC10_SCK, pupdena: disabled, pupdsel: pullDown, ibena: enabled}
  - {pin_num: B8, peripheral: USDHC1, signal: USDHC_CMD, pin_signal: PIO3_9/SD1_CMD/LCD_D10/CTIMER0_MAT1/FC10_TXD_SCL_MISO, ibena: enabled}
  - {pin_num: C8, peripheral: USDHC1, signal: 'USDHC_DATA, 0', pin_signal: PIO3_10/SD1_D0/LCD_D11/CTIMER0_MAT2/FC10_RXD_SDA_MOSI, pupdena: enabled, pupdsel: pullUp,
    ibena: enabled}
  - {pin_num: C10, peripheral: USDHC1, signal: 'USDHC_DATA, 1', pin_signal: PIO3_11/SD1_D1/LCD_D12/CTIMER0_MAT3/FC10_CTS_SDA_SSELN0, pupdena: enabled, pupdsel: pullUp,
    ibena: enabled}
  - {pin_num: N5, peripheral: GPIO, signal: 'PIO2, 10', pin_signal: PIO2_10/SD0_RESET_N/SCT0_GPI6/CTIMER2_MAT0/FC8_SSEL2/SMARTDMA_PIO10}
  - {pin_num: M14, peripheral: GPIO, signal: 'PIO4, 3', pin_signal: PIO4_3/FC7_CTS_SDA_SSEL0, direction: OUTPUT}
  - {pin_num: D12, peripheral: GPIO, signal: 'PIO0, 31', pin_signal: PIO0_31/FC4_CTS_SDA_SSEL0/SCT0_GPI0/SCT0_OUT6/CTIMER4_MAT3/FC3_SSEL2/SEC_PIO0_31, direction: OUTPUT}
  - {pin_num: D6, peripheral: GPIO, signal: 'PIO3, 20', pin_signal: PIO3_20/SD1_RESET_N/LCD_D21/CTIMER4_MAT2, direction: OUTPUT, gpio_init_state: 'false'}
  - {pin_num: E15, peripheral: CLKCTL, signal: 32KHZ_CLKOUT, pin_signal: PIO2_14/SCT0_OUT8/CTIMER_INP1/32KHZ_CLKOUT/SMARTDMA_PIO14/CMP0_A}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

